{
  "nodes": [
    {
      "op": "null", 
      "name": "/conv2d_1_input1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(0, 3, 28, 28)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2d_1/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(32, 3, 3, 3)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2d_1/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_1/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attrs": {"shape": "(1, 32, 1, 1)"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add1", 
      "inputs": [[2, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu1", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_2/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64, 32, 3, 3)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2d_2/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_2/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape3", 
      "attrs": {"shape": "(1, 64, 1, 1)"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3", 
      "inputs": [[8, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu3", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "max_pooling2d_1/pool2d2", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout_1/dropout2", 
      "attrs": {"p": "0.25"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose1", 
      "attrs": {"axes": "[0, 2, 3, 1]"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten1", 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense_1/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(9216, 512)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot1", 
      "inputs": [[16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense_1/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(512,)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add5", 
      "inputs": [[18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu5", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout_2/dropout2", 
      "attrs": {"p": "0.2"}, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense_2/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(512, 3)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot3", 
      "inputs": [[22, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense_2/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(3,)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add7", 
      "inputs": [[24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax1", 
      "attrs": {"axis": "-1"}, 
      "inputs": [[26, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 3, 7, 9, 17, 19, 23, 25], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30
  ], 
  "heads": [[27, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10501]}
}